tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_adc_ex.h
  FunctionalState InjectedDiscontinuousConvMode; /*!< Specifies whether the conversions sequence of ADC group injected
                                               is performed in Complete-sequence/Discontinuous-sequence
                                               (main sequence subdivided in successive parts).
                                               Discontinuous mode is used only if sequencer is enabled (parameter
                                               'ScanConvMode'). If sequencer is disabled, this parameter is discarded.
                                               Discontinuous mode can be enabled only if continuous mode is disabled.
                                               This parameter can be set to ENABLE or DISABLE.
                                               Note: This parameter must be modified when ADC is disabled (before ADC
                                               start conversion or after ADC stop conversion).
                                               Note: For injected group, discontinuous mode converts the sequence
                                               channel by channel (discontinuous length fixed to 1 rank).
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of HAL_ADCEx_InjectedConfigChannel() to
                                                        configure a channel on injected group can impact the
                                                        configuration of other channels previously set. */

  FunctionalState AutoInjectedConv;       /*!< Enables or disables the selected ADC group injected automatic conversion
                                               after regular one
                                               This parameter can be set to ENABLE or DISABLE.
                                               Note: To use Automatic injected conversion, discontinuous mode must
                                                     be disabled ('DiscontinuousConvMode' and
                                                     'InjectedDiscontinuousConvMode' set to DISABLE)
                                               Note: To use Automatic injected conversion, injected group external
                                                     triggers must be disabled ('ExternalTrigInjecConv' set to
                                                     ADC_INJECTED_SOFTWARE_START)
                                               Note: In case of DMA used with regular group: if DMA configured in
                                                     normal mode (single shot) JAUTO will be stopped upon DMA transfer
                                                     complete.
                                                     To maintain JAUTO always enabled, DMA must be configured in
                                                     circular mode.
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of HAL_ADCEx_InjectedConfigChannel() to configure a channel
                                                        on injected group can impact the configuration of other channels
                                                        previously set. */

  uint32_t ExternalTrigInjecConv;         /*!< Selects the external event used to trigger the conversion start of
                                               injected group.
                                               If set to ADC_INJECTED_SOFTWARE_START, external triggers are disabled
                                               and software trigger is used instead.
                                               This parameter can be a value of
                                               @ref ADC_injected_external_trigger_source.
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of HAL_ADCEx_InjectedConfigChannel() to configure a channel
                                                        on injected group can impact the configuration of other channels
                                                        previously set. */

  uint32_t ExternalTrigInjecConvEdge;     /*!< Selects the external trigger edge of injected group.
                                               This parameter can be a value of @ref ADC_injected_external_trigger_edge.
                                               If trigger source is set to ADC_INJECTED_SOFTWARE_START, this parameter
                                               is discarded.
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of HAL_ADCEx_InjectedConfigChannel() to
                                                        configure a channel on injected group can impact the
                                                        configuration of other channels previously set. */

} ADC_InjectionConfTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup ADCEx_Exported_Constants ADC Extended Exported Constants
  * @{
  */

/** @defgroup ADC_injected_external_trigger_source ADC group injected trigger source
  * @{
  */
/* ADC group regular trigger sources for all ADC instances */
#define ADC_INJECTED_SOFTWARE_START          (LL_ADC_INJ_TRIG_SOFTWARE)            /*!< ADC group injected conversion
                                           trigger software start */

#define ADC_EXTERNALTRIGINJEC_T1_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO   )  
#define ADC_EXTERNALTRIGINJEC_T1_CC1         (LL_ADC_INJ_TRIG_EXT_TIM1_CH1    )  
#define ADC_EXTERNALTRIGINJEC_T1_CC2         (LL_ADC_INJ_TRIG_EXT_TIM1_CH2    )  
#define ADC_EXTERNALTRIGINJEC_T1_CC3         (LL_ADC_INJ_TRIG_EXT_TIM1_CH3    )  
#define ADC_EXTERNALTRIGINJEC_T1_CC4         (LL_ADC_INJ_TRIG_EXT_TIM1_CH4    )  
#define ADC_EXTERNALTRIGINJEC_T1_CC5         (LL_ADC_INJ_TRIG_EXT_TIM1_CH5   )  
#define ADC_EXTERNALTRIGINJEC_T1_CC6         (LL_ADC_INJ_TRIG_EXT_TIM1_CH6    )  
#define ADC_EXTERNALTRIGINJEC_T3_CC1         (LL_ADC_INJ_TRIG_EXT_TIM3_CH1    )  
#define ADC_EXTERNALTRIGINJEC_T3_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM3_TRGO   )    
#define ADC_EXTERNALTRIGINJEC_EXT_IT11       (LL_ADC_INJ_TRIG_EXT_EXTI_LINE11 )  
#define ADC_EXTERNALTRIGINJEC_EXT_IT15       (LL_ADC_INJ_TRIG_EXT_EXTI_LINE15 )  

/**
  * @}
  */

